Revit 2027 API
BuiltInFailures.StairRampFailures.IntermediateLandingHigherThanTopRunFailure Property
 Run is reversed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId IntermediateLandingHigherThanTopRunFailure { get; }
Public Shared ReadOnly Property IntermediateLandingHigherThanTopRunFailure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ IntermediateLandingHigherThanTopRunFailure {
	FailureDefinitionId^ get ();
}
static member IntermediateLandingHigherThanTopRunFailure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace